---
kind: method
id: M:Autodesk.Revit.DB.CurtainGrid.GetVGridLineIds
source: html/23e62335-0db9-9b7d-079b-255ca5944c8e.htm
---
# Autodesk.Revit.DB.CurtainGrid.GetVGridLineIds Method

Gets all ElementIds of grid lines in the V direction.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetVGridLineIds()
```

## Returns
The V grid line ElementIds